[NoCoverage] BlockStatement
src/BMICalculator.js:12:33
   const [bmi, setBMI] = useState(null);
   const [category, setCategory] = useState('');
 
-  const handleCalculate = () => {
-    const heightNum = parseFloat(height);
-    const weightNum = parseFloat(weight);
-    if (isNaN(heightNum) || isNaN(weightNum) || heightNum <= 0 || weightNum < 0) {
-      alert('Please enter valid height and weight');
-      return;
-    }
-
-    const bmiValue = WeightHelper.calculateBMI(heightNum, weightNum);
-    const bmiCategory = WeightHelper.getBMICategory(heightNum, weightNum);
-
-    setBMI(bmiValue);
-    setCategory(bmiCategory);
-  };
+  const handleCalculate = () => {};
 
   return (

[NoCoverage] EqualityOperator
src/BMICalculator.js:15:49
   const handleCalculate = () => {
     const heightNum = parseFloat(height);
     const weightNum = parseFloat(weight);
-    if (isNaN(heightNum) || isNaN(weightNum) || heightNum <= 0 || weightNum < 0) {
+    if (isNaN(heightNum) || isNaN(weightNum) || heightNum < 0 || weightNum < 0) {
       alert('Please enter valid height and weight');
       return;

[NoCoverage] LogicalOperator
src/BMICalculator.js:15:9
   const handleCalculate = () => {
     const heightNum = parseFloat(height);
     const weightNum = parseFloat(weight);
-    if (isNaN(heightNum) || isNaN(weightNum) || heightNum <= 0 || weightNum < 0) {
+    if ((isNaN(heightNum) || isNaN(weightNum)) && heightNum <= 0 || weightNum < 0) {
       alert('Please enter valid height and weight');
       return;

[Survived] ArrowFunction
src/BMICalculator.js:36:23
           <input
             type="number"
             value={height}
-            onChange={(e) => setHeight(e.target.value)}
+            onChange={() => undefined}
           />
         </label>

[Survived] ArrowFunction
src/BMICalculator.js:46:23
           <input
             type="number"
             value={weight}
-            onChange={(e) => setWeight(e.target.value)}
+            onChange={() => undefined}
           />
         </label>

[Killed] LogicalOperator
src/BMICalculator.js:51:8
         </label>
       </div>
       <button onClick={handleCalculate}>Calculate BMI</button>
-      {bmi && (
-        <div>
-          <h2>Your BMI: {bmi}</h2>
-          <h3>Category: {category}</h3>
-        </div>
-      )}
+      {bmi || <div>
+          <h2>Your BMI: {bmi}</h2>
+          <h3>Category: {category}</h3>
+        </div>}
     </div>
   );
killedBy: matches snapshot
statusReason: Error: expect(received).toMatchSnapshot()

Snapshot name: `matches snapshot 1`

- Snapshot  - 0
+ Received  + 8

@@ -33,9 +33,17 @@

[Survived] ConditionalExpression
src/BMICalculator.js:51:8
         </label>
       </div>
       <button onClick={handleCalculate}>Calculate BMI</button>
-      {bmi && (
-        <div>
-          <h2>Your BMI: {bmi}</h2>
-          <h3>Category: {category}</h3>
-        </div>
-      )}
+      {false}
     </div>
   );
