[NoCoverage] StringLiteral
src/index.js:7:58
 import App from './App';
 import reportWebVitals from './reportWebVitals';
 
-const root = ReactDOM.createRoot(document.getElementById('root'));
+const root = ReactDOM.createRoot(document.getElementById(""));
 root.render(
   <React.StrictMode>
