[Killed] BlockStatement
src/WeightHelper.js:3:41
 // src/WeightHelper.js
 class WeightHelper {
-    static calculateBMI(height, weight) {
-      if (height <= 0 || weight < 0) {
-        throw new Error('Height must be greater than zero and weight must be non-negative');
-      }
-      const heightInMeters = height / 100;
-      const bmi = weight / (heightInMeters ** 2);
-      return parseFloat(bmi.toFixed(2));
-    }
+    static calculateBMI(height, weight) {}
   
     static getBMICategory(height, weight) {
killedBy: WeightHelper should calculate BMI correctly for various values
statusReason: Error: expected undefined to be close to 22.49 with precision 2

[Killed] EqualityOperator
src/WeightHelper.js:4:11
 // src/WeightHelper.js
 class WeightHelper {
     static calculateBMI(height, weight) {
-      if (height <= 0 || weight < 0) {
+      if (height < 0 || weight < 0) {
         throw new Error('Height must be greater than zero and weight must be non-negative');
       }
killedBy: WeightHelper should handle zero height and non-negative weight
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Height must be greater than zero and weight must be non-negative"

Received function did not throw

[Killed] ConditionalExpression
src/WeightHelper.js:4:11
 // src/WeightHelper.js
 class WeightHelper {
     static calculateBMI(height, weight) {
-      if (height <= 0 || weight < 0) {
+      if (false || weight < 0) {
         throw new Error('Height must be greater than zero and weight must be non-negative');
       }
killedBy: WeightHelper should handle zero height and non-negative weight
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Height must be greater than zero and weight must be non-negative"

Received function did not throw

[Killed] ArithmeticOperator
src/WeightHelper.js:7:30
       if (height <= 0 || weight < 0) {
         throw new Error('Height must be greater than zero and weight must be non-negative');
       }
-      const heightInMeters = height / 100;
+      const heightInMeters = height * 100;
       const bmi = weight / (heightInMeters ** 2);
       return parseFloat(bmi.toFixed(2));
killedBy: WeightHelper should calculate BMI correctly for various values
statusReason: Error: expected 0 to be close to 22.49 with precision 2

[Killed] ArithmeticOperator
src/WeightHelper.js:8:19
         throw new Error('Height must be greater than zero and weight must be non-negative');
       }
       const heightInMeters = height / 100;
-      const bmi = weight / (heightInMeters ** 2);
+      const bmi = weight * heightInMeters ** 2;
       return parseFloat(bmi.toFixed(2));
     }
killedBy: WeightHelper should calculate BMI correctly for various values
statusReason: Error: expected 187.85 to be close to 22.49 with precision 2

[Killed] BlockStatement
src/WeightHelper.js:12:43
       return parseFloat(bmi.toFixed(2));
     }
   
-    static getBMICategory(height, weight) {
-      const bmi = this.calculateBMI(height, weight);
-  
-      if (bmi < 18.5) {
-        return "Underweight";
-      } else if (bmi >= 18.5 && bmi < 25) {
-        return "Normal weight";
-      } else if (bmi >= 25 && bmi < 30) {
-        return "Overweight";
-      } else {
-        return "Obese";
-      }
-    }
+    static getBMICategory(height, weight) {}
   }
   
killedBy: WeightHelper should return "Underweight" for BMI less than 18.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: undefined

[Killed] BlockStatement
src/WeightHelper.js:15:23
     static getBMICategory(height, weight) {
       const bmi = this.calculateBMI(height, weight);
   
-      if (bmi < 18.5) {
-        return "Underweight";
-      } else if (bmi >= 18.5 && bmi < 25) {
+      if (bmi < 18.5) {} else if (bmi >= 18.5 && bmi < 25) {
         return "Normal weight";
       } else if (bmi >= 25 && bmi < 30) {
killedBy: WeightHelper should return "Underweight" for BMI less than 18.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: undefined

[Killed] ConditionalExpression
src/WeightHelper.js:15:11
     static getBMICategory(height, weight) {
       const bmi = this.calculateBMI(height, weight);
   
-      if (bmi < 18.5) {
+      if (true) {
         return "Underweight";
       } else if (bmi >= 18.5 && bmi < 25) {
killedBy: WeightHelper should return "Normal weight" for BMI between 18.5 and 24.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: "Underweight"

[Killed] StringLiteral
src/WeightHelper.js:16:16
       const bmi = this.calculateBMI(height, weight);
   
       if (bmi < 18.5) {
-        return "Underweight";
+        return "";
       } else if (bmi >= 18.5 && bmi < 25) {
         return "Normal weight";
killedBy: WeightHelper should return "Underweight" for BMI less than 18.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: ""

[Killed] BlockStatement
src/WeightHelper.js:17:43
   
       if (bmi < 18.5) {
         return "Underweight";
-      } else if (bmi >= 18.5 && bmi < 25) {
-        return "Normal weight";
-      } else if (bmi >= 25 && bmi < 30) {
+      } else if (bmi >= 18.5 && bmi < 25) {} else if (bmi >= 25 && bmi < 30) {
         return "Overweight";
       } else {
killedBy: WeightHelper should return "Normal weight" for BMI between 18.5 and 24.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: undefined

[Killed] LogicalOperator
src/WeightHelper.js:17:18
   
       if (bmi < 18.5) {
         return "Underweight";
-      } else if (bmi >= 18.5 && bmi < 25) {
+      } else if (bmi >= 18.5 || bmi < 25) {
         return "Normal weight";
       } else if (bmi >= 25 && bmi < 30) {
killedBy: WeightHelper should return "Overweight" for BMI between 25 and 29.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Overweight"
Received: "Normal weight"

[Killed] StringLiteral
src/WeightHelper.js:18:16
       if (bmi < 18.5) {
         return "Underweight";
       } else if (bmi >= 18.5 && bmi < 25) {
-        return "Normal weight";
+        return "";
       } else if (bmi >= 25 && bmi < 30) {
         return "Overweight";
killedBy: WeightHelper should return "Normal weight" for BMI between 18.5 and 24.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: ""

[Killed] EqualityOperator
src/WeightHelper.js:19:31
         return "Underweight";
       } else if (bmi >= 18.5 && bmi < 25) {
         return "Normal weight";
-      } else if (bmi >= 25 && bmi < 30) {
+      } else if (bmi >= 25 && bmi >= 30) {
         return "Overweight";
       } else {
killedBy: WeightHelper should return "Overweight" for BMI between 25 and 29.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Overweight"
Received: "Obese"

[Killed] ConditionalExpression
src/WeightHelper.js:19:18
         return "Underweight";
       } else if (bmi >= 18.5 && bmi < 25) {
         return "Normal weight";
-      } else if (bmi >= 25 && bmi < 30) {
+      } else if (true) {
         return "Overweight";
       } else {
killedBy: WeightHelper should return "Obese" for BMI 30 or more
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Obese"
Received: "Overweight"

[Killed] StringLiteral
src/WeightHelper.js:20:16
       } else if (bmi >= 18.5 && bmi < 25) {
         return "Normal weight";
       } else if (bmi >= 25 && bmi < 30) {
-        return "Overweight";
+        return "";
       } else {
         return "Obese";
killedBy: WeightHelper should return "Overweight" for BMI between 25 and 29.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Overweight"
Received: ""

[Killed] BlockStatement
src/WeightHelper.js:21:14
         return "Normal weight";
       } else if (bmi >= 25 && bmi < 30) {
         return "Overweight";
-      } else {
-        return "Obese";
-      }
+      } else {}
     }
   }
killedBy: WeightHelper should return "Obese" for BMI 30 or more
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Obese"
Received: undefined
