[Killed] BlockStatement
src/App.js:7:16
 import './App.css';
 import BMICalculator from './BMICalculator';
 
-function App() {
-  return (
-    <div className="App">
-      <header className="App-header">
-        <BMICalculator />
-      </header>
-    </div>
-  );
-}
+function App() {}
 
 export default App;
killedBy: renders BMI Calculator header
statusReason: TestingLibraryElementError: Unable to find an element with the text: /BMI Calculator/i. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

Ignored nodes: comments, script, style
<body>
  <div />
</body>
