[Killed] ConditionalExpression
src/WeightHelper.js:5:26
 
 class WeightHelper {
     static calculateBMI(height, weight) {
-      if (height <= 0 || weight < 0) {
+      if (height <= 0 || false) {
         throw new Error('Height must be greater than zero and weight must be non-negative');
       }
killedBy: WeightHelper should handle negative weight and positive height
statusReason: Error: expect(received).toThrow(expected)

Expected substring: "Height must be greater than zero and weight must be non-negative"

Received function did not throw

[Killed] ConditionalExpression
src/WeightHelper.js:16:11
     static getBMICategory(height, weight) {
       const bmi = this.calculateBMI(height, weight);
   
-      if (bmi < 18.5) {
+      if (false) {
         return "Underweight";
       } else if (bmi >= 18.5 && bmi < 25) {
killedBy: WeightHelper should return "Underweight" for BMI less than 18.5
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Underweight"
Received: "Obese"

[Killed] EqualityOperator
src/WeightHelper.js:18:18
   
       if (bmi < 18.5) {
         return "Underweight";
-      } else if (bmi >= 18.5 && bmi < 25) {
+      } else if (bmi < 18.5 && bmi < 25) {
         return "Normal weight";
       } else if (bmi >= 25 && bmi < 30) {
killedBy: WeightHelper should return "Normal weight" for BMI between 18.5 and 24.9
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Normal weight"
Received: "Obese"

[Killed] ConditionalExpression
src/WeightHelper.js:20:31
         return "Underweight";
       } else if (bmi >= 18.5 && bmi < 25) {
         return "Normal weight";
-      } else if (bmi >= 25 && bmi < 30) {
+      } else if (bmi >= 25 && true) {
         return "Overweight";
       } else {
killedBy: WeightHelper should return "Obese" for BMI 30 or more
statusReason: Error: expect(received).toBe(expected) // Object.is equality

Expected: "Obese"
Received: "Overweight"
